:PROPERTIES:
:ID:       5384b6eb-4c00-4b1b-b4f7-bb2d70ee80c9
:END:
#+title: ENG308 - Communication Systems 1 - Assignment 2
#+date: [2025-05-08 Thu 13:05]
#+AUTHOR: Baley Eccles - 652137
#+STARTUP: latexpreview

**** e
#+BEGIN_SRC octave :exports none :results output :session Gray2
clc
clear
close all

if exist('OCTAVE_VERSION', 'builtin')
  set(0, "DefaultAxesFontSize", 25);
end

x = [-5, -3, -3, -3, -1, -1,  0,  0,  0,  0,  1,  1,  3,  3,  3,  5];
y = [0, -3,  0,  3, -1,  1, -5, -3,  3,  5,  1, -1,  3,  0, -3,  0];
g = [0b0000, 0b0001, 0b0011, 0b0010, ...
     0b0100, 0b0101, 0b0111, 0b0110,...
     0b1100, 0b1101, 0b1111, 0b1110, ...
     0b1000, 0b1001, 0b1011, 0b1010];
c = [x', y', g'];
h = convhull (x, y);
[vx, vy] = voronoi (x, y);
plot (vx, vy, "-b", x, y, "or");
grid on;
xlim([min(x) - abs(min(x)/2), max(x) + abs(max(x)/2)]);
ylim([min(y) - abs(min(y)/2), max(y) + abs(max(y)/2)]);
for i = 1:length(x)
  text(x(i) + 0.1, y(i) - 0.1, dec2bin(g(i), 4), 'FontSize', 25, 'Color', 'blue');
end
title("Standard 4 x 4 signal set Gray Coding")
print -dpng 'ENG308_Gray1.png'
#+END_SRC

#+RESULTS:
I	Q	Symbol	Gray Code
-3	+3	(-3,+3)	00 10
-3	+1	(-3,+1)	00 11
-3	-1	(-3,-1)	00 01
-3	-3	(-3,-3)	00 00
-1	+3	(-1,+3)	01 10
-1	+1	(-1,+1)	01 11
-1	-1	(-1,-1)	01 01
-1	-3	(-1,-3)	01 00
+1	+3	(+1,+3)	11 10
+1	+1	(+1,+1)	11 11
+1	-1	(+1,-1)	11 01
+1	-3	(+1,-3)	11 00
+3	+3	(+3,+3)	10 10
+3	+1	(+3,+1)	10 11
+3	-1	(+3,-1)	10 01
+3	-3	(+3,-3)	10 00

